archive/before-2018-11-10/2018-06-10-从evil到xah-fly-keys.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>从evil到xah-fly-keys</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">从evil到xah-fly-keys</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6336d55">1. 和evil的区别</a></li>
<li><a href="#orgd45a288">2. 需要注意</a></li>
<li><a href="#org7488e95">3. <span class="todo TODO">TODO</span> normal模式中evil中对应的功能</a></li>
</ul>
</div>
</div>
<p>
最近写了好几个月的C，强度比较大，感觉手指开始有点不太舒服。一直都用的
evil，以前也一直想着换到 `xah-fly-keys' ，干脆这次试下它。
</p>

<div id="outline-container-org6336d55" class="outline-2">
<h2 id="org6336d55"><span class="section-number-2">1</span> 和evil的区别</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>不同于evil中有很多种模式，`xah-fly-keys' 中只有insert和command两
种模式。</li>
<li>evil中定义了各种的map，比如 `evil-insert-mode-map'，
`evil-normal-mode-map'，`evil-insert-mode-local-map'等等，
`xah-fly-keys'中只有很少的几个map。
<ol class="org-ol">
<li>`xah-fly-key-map' ：这个是主要的map，command模式中的命令主要就
是绑定到它。这个mode在insert和command模式下都会修改。进入
command模式的时候，调用 `xah-fly-command-mode-init'设置它。进
入insert模式时，调用 `xah-fly-insert-mode-init' 设置它。如果想
用自定义 `xah-fly-key-map' ，可以在
`xah-fly-insert-mode-activate-hook'和
`xah-fly-command-mode-activate-hook'两个hook中把它们覆盖掉。</li>
<li>`xah-fly-leader-key-map' ：这个是以`leader-key'（默认是SPC）为
开头的所有map。</li>
<li>其它的map，比如 `xah-fly-c-keymap'， 都基本绑定到
`xah-fly-leader-key-map'上。</li>
<li>evil在normal模式下一般回车，大写字母， <code>\,/</code> 等等这些都是有特
殊用处的。在`xah-fly-keys'的command-mode中，它们是可以继续使用
的。这个功能我还在体验中。</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgd45a288" class="outline-2">
<h2 id="orgd45a288"><span class="section-number-2">2</span> 需要注意</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>默认`xah-fly-keys'中的map是以drorak命名的，比如`xah-fly-c-keymap'
应该是我们常用键盘的`i'。</li>
</ol>
</div>
</div>

<div id="outline-container-org7488e95" class="outline-2">
<h2 id="org7488e95"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> normal模式中evil中对应的功能</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> A: <code>;f</code></li>
<li class="off"><code>[&#xa0;]</code> I: <code>hf</code></li>
<li class="off"><code>[&#xa0;]</code> f,t:</li>
<li class="off"><code>[&#xa0;]</code> y: <code>c</code></li>
<li class="off"><code>[&#xa0;]</code> d: <code>x</code></li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Evil</th>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Xah-fly-keys Replacement</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left">goto end of line and activiate insert mode</td>
<td class="org-left"><code>;f</code></td>
</tr>

<tr>
<td class="org-left"><code>I</code></td>
<td class="org-left">goto beginning of line and activiate insertmode</td>
<td class="org-left"><code>hf</code></td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">find some char in current line</td>
<td class="org-left"><code>N/A</code></td>
</tr>

<tr>
<td class="org-left"><code>t</code></td>
<td class="org-left">&#x2026;</td>
<td class="org-left"><code>N/A</code></td>
</tr>

<tr>
<td class="org-left"><code>vi"</code></td>
<td class="org-left">select all text between ""</td>
<td class="org-left"><code>9</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>